src/AccumulationRegisters/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/СерииНоменклатуры/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СерииНоменклатуры.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияСерииНоменклатурыИзменение Тогда
		
		// Если временная таблица "ДвиженияСерииНоменклатурыИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияСерииНоменклатурыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СерииНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	СерииНоменклатуры.Номенклатура КАК Номенклатура,
		|	СерииНоменклатуры.Характеристика КАК Характеристика,
		|	СерииНоменклатуры.Партия КАК Партия,
		|	СерииНоменклатуры.Серия КАК Серия,
		|	СерииНоменклатуры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СерииНоменклатуры.Ячейка КАК Ячейка,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА СерииНоменклатуры.Количество
		|		ИНАЧЕ -СерииНоменклатуры.Количество
		|	КОНЕЦ КАК КоличествоПередЗаписью
		|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыПередЗаписью
		|ИЗ
		|	РегистрНакопления.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияСерииНоменклатурыИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблицу "ДвиженияСерииНоменклатурыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияСерииНоменклатурыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСерииНоменклатурыИзменение.Номенклатура КАК Номенклатура,
		|	ДвиженияСерииНоменклатурыИзменение.Характеристика КАК Характеристика,
		|	ДвиженияСерииНоменклатурыИзменение.Партия КАК Партия,
		|	ДвиженияСерииНоменклатурыИзменение.Серия КАК Серия,
		|	ДвиженияСерииНоменклатурыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДвиженияСерииНоменклатурыИзменение.Ячейка КАК Ячейка,
		|	ДвиженияСерииНоменклатурыИзменение.КоличествоПередЗаписью КАК КоличествоПередЗаписью
		|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыПередЗаписью
		|ИЗ
		|	ДвиженияСерииНоменклатурыИзменение КАК ДвиженияСерииНоменклатурыИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СерииНоменклатуры.НомерСтроки,
		|	СерииНоменклатуры.Номенклатура,
		|	СерииНоменклатуры.Характеристика,
		|	СерииНоменклатуры.Партия,
		|	СерииНоменклатуры.Серия,
		|	СерииНоменклатуры.СтруктурнаяЕдиница,
		|	СерииНоменклатуры.Ячейка,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА СерииНоменклатуры.Количество
		|		ИНАЧЕ -СерииНоменклатуры.Количество
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияСерииНоменклатурыИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСерииНоменклатурыИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияСерииНоменклатурыИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияСерииНоменклатурыИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияСерииНоменклатурыИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияСерииНоменклатурыИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияСерииНоменклатурыИзменение.Характеристика КАК Характеристика,
	|	ДвиженияСерииНоменклатурыИзменение.Партия КАК Партия,
	|	ДвиженияСерииНоменклатурыИзменение.Серия КАК Серия,
	|	ДвиженияСерииНоменклатурыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияСерииНоменклатурыИзменение.Ячейка КАК Ячейка,
	|	СУММА(ДвиженияСерииНоменклатурыИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияСерииНоменклатурыИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияСерииНоменклатурыИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияСерииНоменклатурыПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияСерииНоменклатурыПередЗаписью.Номенклатура КАК Номенклатура,
	|		ДвиженияСерииНоменклатурыПередЗаписью.Характеристика КАК Характеристика,
	|		ДвиженияСерииНоменклатурыПередЗаписью.Партия КАК Партия,
	|		ДвиженияСерииНоменклатурыПередЗаписью.Серия КАК Серия,
	|		ДвиженияСерииНоменклатурыПередЗаписью.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ДвиженияСерииНоменклатурыПередЗаписью.Ячейка КАК Ячейка,
	|		ДвиженияСерииНоменклатурыПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияСерииНоменклатурыПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи
	|	ИЗ
	|		ДвиженияСерииНоменклатурыПередЗаписью КАК ДвиженияСерииНоменклатурыПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСерииНоменклатурыПриЗаписи.НомерСтроки,
	|		ДвиженияСерииНоменклатурыПриЗаписи.Номенклатура,
	|		ДвиженияСерииНоменклатурыПриЗаписи.Характеристика,
	|		ДвиженияСерииНоменклатурыПриЗаписи.Партия,
	|		ДвиженияСерииНоменклатурыПриЗаписи.Серия,
	|		ДвиженияСерииНоменклатурыПриЗаписи.СтруктурнаяЕдиница,
	|		ДвиженияСерииНоменклатурыПриЗаписи.Ячейка,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияСерииНоменклатурыПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияСерииНоменклатурыПриЗаписи.Количество
	|			ИНАЧЕ ДвиженияСерииНоменклатурыПриЗаписи.Количество
	|		КОНЕЦ,
	|		ДвиженияСерииНоменклатурыПриЗаписи.Количество
	|	ИЗ
	|		РегистрНакопления.СерииНоменклатуры КАК ДвиженияСерииНоменклатурыПриЗаписи
	|	ГДЕ
	|		ДвиженияСерииНоменклатурыПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияСерииНоменклатурыИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСерииНоменклатурыИзменение.Номенклатура,
	|	ДвиженияСерииНоменклатурыИзменение.Характеристика,
	|	ДвиженияСерииНоменклатурыИзменение.Партия,
	|	ДвиженияСерииНоменклатурыИзменение.Серия,
	|	ДвиженияСерииНоменклатурыИзменение.СтруктурнаяЕдиница,
	|	ДвиженияСерииНоменклатурыИзменение.Ячейка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияСерииНоменклатурыИзменение.КоличествоИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Серия,
	|	СтруктурнаяЕдиница,
	|	Ячейка");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияСерииНоменклатурыИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияСерииНоменклатурыИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияСерииНоменклатурыПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСерииНоменклатурыПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
